# 롤 챔프 랜덤 추천 프로그램


import random
champcategory=
{'1.암살자': {'기동형암살자' : ['녹턴', '샤코', '아칼리', '에코', '요네', '이블린', '제드', '카사딘', '카직스', '카타리나', '탈론', '피즈']},
         {'전투형 암살자':['그웬','닐라','리븐','마스터이','벨베스','비에고','야스오','잭스','트린다미어','피오라']}},
{'2.전사':{'돌격형 전사' :['가렌', '나서스', '다리우스', '모데카이저', '문도 박사', '볼리베어', '세트', '쉬바나', '스카너', '올라프', '요릭', '우디르', '일라오이', '트런들']},
 {'기동형 전사':['다이애나','렉사이','렝가', '리 신', '바이', '신 짜오', '아트록스', '엘리스', '오공', '워윅', '이렐리아', '자르반 4세', '카밀', '클레드', '크산테', '판테온', '헤카림' ]},
{'3.마법사':{'집중형 마법사':['럭스', '르블랑', '리산드라', '베이가', '브랜드', '신드라', '아리', '애니', '오리아나', '트위스티드 페이트', '흐웨이']}},
 {'광역형 마법사':['라이즈','럼블','말자하','블라디미르','빅토르','스웨인','아우렐리온 솔','애니비아','카서스','카시오페아','탈리야']}},
{'견제형 마법사':['럭스','바루스','벨코즈','제라스','제이스','직스']},
{'4.원거리 딜러':['드레이븐','루시안','미스 포츈','바루스','베인','사미라','세나','시비르','아크샨','아펠리오스','애쉬','이즈리얼','자야','제리','진','징크스','카이사','칼리스타','케이틀린','코그모','코르키','킨드레드','트리스타나','트위치']},
{'5.서포터':{'강화형 보조술사':['나미','룰루','소나','소라카','잔나','카르마','타릭']},
 {'포획형 보조술사':['라칸','모르가나','바드','블리츠크랭크','쓰레쉬','아이번','자이라','진']}}
{'6.탱커':{'공격형 탱커':'그라가스', '노틸러스', '람머스', '레오나', '렐', '마오카이', '말파이트', '메가 나르', '사이온', '세주아니', '아무무', '알리스타', '오른', '자크'}}
{'수비형 탱커':['갈리오','브라움','뽀삐','쉔','타릭','탐켄치','트런들','크산테']}


복사본
champcategory={'1.암살자':['녹턴', '샤코', '아칼리', '에코', '요네', '이블린', '제드', '카사딘', '카직스', '카타리나', '탈론', '피즈',
                          '그웬', '닐라', '리븐', '마스터이', '벨베스', '비에고', '야스오', '잭스', '트린다미어', '피오라'],
'2.전사':['가렌', '나서스', '다리우스', '모데카이저', '문도 박사', '볼리베어', '세트', '쉬바나', '스카너', '올라프', '요릭', '우디르', '일라오이', '트런들',
         '다이애나', '렉사이','렝가', '리 신', '바이', '신 짜오', '아트록스', '엘리스', '오공', '워윅', '이렐리아', '자르반 4세', '카밀', '클레드', '크산테', '판테온', '헤카림' ,       ],
'3.마법사':['럭스', '르블랑', '리산드라', '베이가', '브랜드', '신드라', '아리', '애니', '오리아나', '트위스티드 페이트', '흐웨이'
         '라이즈','럼블','말자하','블라디미르','빅토르','스웨인','아우렐리온 솔','애니비아','카서스','카시오페아','탈리야'],

'4.원거리 딜러':['드레이븐','루시안','미스 포츈','바루스','베인','사미라','세나','시비르','아크샨','아펠리오스','애쉬','이즈리얼','자야','제리','진','징크스','카이사','칼리스타','케이틀린','코그모','코르키','킨드레드','트리스타나','트위치'],
'5.서포터':['나미','룰루','소나','소라카','잔나','카르마','타릭','라칸','모르가나','바드','블리츠크랭크','쓰레쉬','아이번','자이라','진'],
'6.탱커':['그라가스', '노틸러스', '람머스', '레오나', '렐', '마오카이', '말파이트', '메가 나르', '사이온', '세주아니', '아무무', '알리스타', '오른', '자크']
}