import random
favorite=input("역할군을 중 하나를 입력하세요:(종류:암살자,전사,마법사,원거리 딜러,서포터,탱커:")

champlist = []
if favorite=='암살자':
    champlist=['녹턴', '샤코', '아칼리', '에코', '요네', '이블린', '제드', '카사딘', '카직스', '카타리나', '탈론', '피즈',
                          '그웬', '닐라', '리븐', '마스터이', '벨베스', '비에고', '야스오', '잭스', '트린다미어', '피오라','티모']
elif favorite=='전사':
    champlist=['가렌', '나서스', '다리우스', '모데카이저', '문도 박사', '볼리베어', '세트', '쉬바나', '스카너', '올라프', '요릭', '우디르', '일라오이', '야스오','트런들',
         '다이애나', '렉사이','렝가', '리 신', '바이', '신 짜오', '아트록스', '엘리스', '오공', '워윅', '이렐리아', '자르반 4세', '카밀', '클레드', '크산테', '판테온', '헤카림' ,       ]
elif favorite=='마법사':
    champlist=['럭스', '르블랑', '리산드라', '베이가', '브랜드', '신드라', '아리', '애니', '오리아나', '트위스티드 페이트', '흐웨이'
         '라이즈','럼블','말자하','블라디미르','빅토르','스웨인','아우렐리온 솔','애니비아','카서스','카시오페아','탈리야']
elif favorite=='원거리 딜러':
    champlist=['드레이븐','루시안','미스 포츈','바루스','베인','사미라','세나','시비르','아크샨','아펠리오스','애쉬','이즈리얼','자야','제리','진','징크스','카이사','칼리스타','케이틀린','코그모','코르키','킨드레드','트리스타나','트위치']
elif favorite=='서포터':
    champlist=['나미','룰루','소나','소라카','잔나','카르마','타릭','라칸','모르가나','바드','블리츠크랭크','쓰레쉬','아이번','자이라','진']
elif favorite=='탱커':
    champlist=['그라가스', '노틸러스', '람머스', '레오나', '렐', '마오카이', '말파이트', '메가 나르', '사이온', '세주아니', '아무무', '알리스타', '오른', '자크']
else:
    print('존재하지 않는 역할군입니다.')

blacklist = ['가렌','모데카이저','이블린','요릭','베인','티모','야스오','마스터 이','아이번','']
if len(champlist):
    yourchamp=random.choice(champlist)
    while True:
        yourchamp = random.choice(champlist)
        print(f'선택된 챔피언은:{yourchamp}입니다.')
        if yourchamp in blacklist:
            print(f"{yourchamp}는 권장하지 않습니다. 다시 선택합니다.")
        else:
            print("선택이 완료되었습니다.")
            break







